# Глобальные
gl_next = "▶️ Далее"
gl_back = "◀️ Назад"
gl_yes = "✅ Да"
gl_yep = "✅ дэ"
gl_no = "❌ Нет"
gl_cancel = "❌ Отмена"
gl_error = "⚠️ Ошибка"
gl_try_again = "Попробуй снова"
gl_error_try_again = f"{gl_error}. {gl_try_again}."
gl_refresh = "🔄 Обновить"
gl_delete = "🗑️ Удалить"
gl_edit = "✏️ Изменить"
gl_configure = "⚙️ Настроить"
gl_pcs = "шт."
gl_last_update = "Последнее обновление"

# - Главное меню
mm_language = "🗣️ Язык"
mm_global = "⚙️ Глобальные переключатели"
mm_notifications = "🔔 Настройки уведомлений"
mm_autoresponse = "🤖 Настройки автоответа"
mm_autodelivery = "📦 Настройки авто-выдачи"
mm_blacklist = "🚫 Настройки черного списка"
mm_templates = "📝 Заготовки ответов"
mm_greetings = "👋 Приветственное сообщение"
mm_order_confirm = "✅ Ответ на подтверждение заказа"
mm_review_reply = "⭐ Ответ на отзывы"
mm_new_msg_view = "✉️ Вид увед. о новых сообщениях"
mm_plugins = "🧩 Плагины"
mm_configs = "📁 Конфиги"
mm_authorized_users = "👥 Авторизованные пользователи"
mm_proxy = "🌐 Прокси"

# Глобальные переключатели
gs_autoraise = "{} Автоподнятие"
gs_autoresponse = "{} Автоответчик"
gs_autodelivery = "{} Авто-выдача"
gs_nultidelivery = "{} Мульти-выдача"
gs_autorestore = "{} Восстановление лотов"
gs_autodisable = "{} Деактивация лотов"
gs_old_msg_mode = "{} Старый режим получения сообщений"
gs_keep_sent_messages_unread = "{} Оставлять непрочитанным при отправке"

# Настройки уведомлений
ns_new_msg = "{} Новое сообщение"
ns_cmd = "{} Получена команда"
ns_new_order = "{} Новый заказ"
ns_order_confirmed = "{} Заказ подтвержден"
ns_lot_activate = "{} Восстановление лота"
ns_lot_deactivate = "{} Деактивация лота"
ns_delivery = "{} Выдача товара"
ns_raise = "{} Поднятие лотов"
ns_new_review = "{} Оставлен отзыв"
ns_bot_start = "{} Запуск бота"
ns_other = "{} Прочее (плагины)"

# Настройки автоответа
ar_edit_commands = "✏️ Редактировать существующие команды"
ar_add_command = "➕ Добавить команду / сет команд"
ar_to_ar = "🤖 В настройки автоответчика"
ar_to_mm = "📋 В главное меню"
ar_edit_response = "✏️ Редактировать ответ"
ar_edit_notification = "✏️ Редактировать уведомление"
ar_notification = "{} Уведомление в Telegram"
ar_add_more = "➕ Добавить еще"
ar_add_another = "➕ Добавить другую"

# Настройки авто-выдачи
ad_edit_autodelivery = "🗳️ Редактировать авто-выдачу лотов"
ad_add_autodelivery = "➕ Привязать авто-выдачу лоту"
ad_add_another_ad = "➕ Привязать другой"
ad_add_more_ad = "➕ Привязать еще"
ad_edit_goods_file = "📋 Редактировать товарные файлы"
ad_upload_goods_file = "⤴️ Выгрузить товарный файл"
ad_create_goods_file = "➕ Создать товарный файл"
ad_to_ad = "📦 В настройки авто-выдачи"
ad_to_mm = "📋 В главное меню"

# - Редактировать авто-выдачу
ea_edit_delivery_text = "✏️ Редактировать текст выдачи"
ea_link_goods_file = "⛓️ Привязать товарный файл"
ea_delivery = "{} Авто-выдача"
ea_multidelivery = "{} Мультивыдача"
ea_restore = "{} Восстановление"
ea_deactivate = "{} Деактивация"
ea_test = "🗝️ Ключ выдачи"
ea_more_test = "🗝️ Еще 1 ключ"
ea_link_another_gf = "⛓️ Другой файл"

# - Добавить авто-выдачу
fl_manual = "➕ Ввести вручную"

# - Товарные файлы
gf_add_goods = "➕ Добавить товары"
gf_download = "⤵️ Скачать"
gf_create_another = "➕ Создать другой"
gf_create_more = "➕ Создать еще"
gf_add_more = "➕ Добавить еще"
gf_try_add_again = "➕ Еще раз"

# Настройки черного списка
bl_autodelivery = "{} Не выдавать товар"
bl_autoresponse = "{} Не отвечать на команды"
bl_new_msg_notifications = "{} Не увед. о новых сообщениях"
bl_new_order_notifications = "{} Не увед. о новых заказах"
bl_command_notifications = "{} Не увед. о полученных командах"

# Заготовки ответа
tmplt_add = "➕ Добавить заготовку"
tmplt_add_more = "➕ Добавить еще"
tmplt_add_another = "➕ Добавить другую"

# Настройки приветствия
gr_greetings = "{} Приветствовать пользователей"
gr_ignore_sys_msgs = "{} Игнорировать системные сообщения"
gr_edit_message = "✏️ Изменить текст приветственного сообщения"
gr_edit_cooldown = "⏱️ Кулдаун: {} дн."

# Настройки ответа на подтверждение заказа
oc_watermark = "{} Вотермарка сообщений"
oc_send_reply = "{} Отправлять сообщение"
oc_edit_message = "✏️ Изменить текст сообщения"

# Настройки вида уведомлений о новых сообщений
mv_incl_my_msg = "{} Отображать мои сообщения"
mv_incl_fp_msg = "{} Отображать сообщения FunPay"
mv_incl_bot_msg = "{} Отображать сообщения бота"
mv_only_my_msg = "{} Увед., если сообщения только от меня"
mv_only_fp_msg = "{} Увед., если сообщения только от FP"
mv_only_bot_msg = "{} Увед., если сообщения только от бота"
mv_show_image_name = "{} Отображать названия изображений"

# Плагины
pl_add = "➕ Добавить плагин"
pl_activate = "Активировать"
pl_deactivate = "Деактивировать"
pl_commands = "⌨️ Команды"
pl_settings = "⚙️ Настройки"

# Конфиги
cfg_download_main = "⤵️ Загрузить основной конфиг"
cfg_download_ar = "⤵️ Загрузить конфиг автоответа"
cfg_download_ad = "⤵️ Загрузить конфиг авто-выдачи"
cfg_upload_main = "⤴️ Выгрузить основной конфиг"
cfg_upload_ar = "⤴️ Выгрузить конфиг автоответа"
cfg_upload_ad = "⤴️ Выгрузить конфиг авто-выдачи"

# Авторизованные пользователи
tg_block_login = "{} Блокировать входы по паролю"

# Прокси
prx_proxy_add = "➕ Добавить прокси"

# Ссылки
lnk_github = "🛠️ Создать своего бота FunPay"
lnk_updates = "🔄 Обновления"
lnk_chat = "💬 Чат"

# Объявления
an_an = "{} Объявления"
an_ad = "{} Реклама"

# Новый заказ
ord_refund = "💸 Вернуть деньги"
ord_open = "🌐 Открыть страницу заказа"
ord_answer = "📨 Ответить"
ord_templates = "📝 Заготовки"

# Новое сообщение
msg_reply = "📨 Ответ"
msg_reply2 = "📨 Отправить еще"
msg_templates = "📝 Заготовки"
msg_more = "➕ Больше"

# Текста сообщений
access_denied = "👋 Привет, <b><i>{}</i></b>!\n\n❌ Ты неавторизованный пользователь.\n\n" \
                "🔑 Отправь мне <u><b>секретный пароль</b></u>, который ты ввел при первичной настройке, " \
                "чтобы начать работу."

access_granted = "🔓 Доступ к ПУ предоставлен!\n\n" \
                 "🔕 Учти, что сейчас я <b><u>не отправляю никакие уведомления в этот чат</u></b>.\n\n" \
                 "🔔 Ты можешь настроить уведомления для <b><u>этого чата</u></b> в меню настроек.\n\n" \
                 "⚙️ Чтобы открыть меню настроек <i>FunPay Cardinal</i>, введи команду /menu."

access_granted_notification = "<b>🚨 ВНИМАНИЕ! 🚨\n\n\n</b>" * 3 + "\n\n\n🔐 \"<a href=\"tg://user?id={1}\"> {0} </a>\" " \
                                                                 "<b>(ID: {1}) только что получил доступ к ПУ Telegram! 🔓</b>"

param_disabled = "❌ Данный параметр отключен глобально и не может быть изменен для этого лота.\n\n" \
                 "❔ Переключение глобальных параметров доступно в меню глобальных переключателей " \
                 "(/menu -> ⚙️ Глобальные переключатели)."

old_mode_help = """<b>Новый режим получения сообщений</b>
✅ <i>FPC</i> получает полную историю чата и видит все данные о всех новых сообщениях.
✅ <i>FPC</i> может видеть изображения в чате и пересылать их в <i>Telegram</i> чат.
✅ <i>FPC</i> может точно определить, кто именно написал, будь то ты, твой собеседник или 3е лицо (арбитраж).
❌ Из-за того что <i>FPC</i> получает полную историю чата для обнаружения новых сообщений, чат становится "прочитанным" (не загорается оранжевым).

<b>Старый режим получения сообщений</b>
✅ Не прочитанные лично тобой чаты остаются непрочитанными (загораются оранжевым цветом).
✅ Работает чуть-чуть быстрее нового.
❌ <i>FPC</i> не получает полную историю чата, вследствие чего видит только последнее сообщение, а не все. Если пользователь быстро напишет несколько сообщений, <i>FPC</i> увидит только последнее.
❌ <i>FPC</i> не может видеть изображения в чате и пересылать их в <i>Telegram</i> чат.
❌ <i>FPC</i> не может точно определить, кто именно написал: ты или собеседник. Если чат не прочитан, значит сообщение от собеседника, иначе - от тебя. Однако, если ты смотришь чат в момент получения сообщений, данная логика иногда может сбоить. Так же <i>FPC</i> не сможет определить, что в чат написало 3е лицо (арбитраж).

❗ Если нажать кнопку <code>Больше</code> в уведомлении о новом сообщении, <i>FPC</i> "прочитает" чат и покажет последние 15 сообщений, в том числе изображения. Так же <i>FPC</i> сможет определить, кто именно автор сообщений."""

bot_started = """✅ Telegram-бот запущен!\n
✅ Ты <b><u>можешь настраивать конфиги</u></b> и полностью <b><u>использовать функционал <i>Telegram</i> бота</u></b>.\n
❌ <i>FunPay Cardinal</i> еще <b><u>не инициализирован</u></b> и <b><u>никакие его функции не работают</u></b>.\n
🔃 Как только <i>FunPay Cardinal</i> инициализируется, данное сообщение изменится.\n
📋 Если <i>FPC</i> долго не инициализируется, проверь логи с помощью команды /logs"""

fpc_init = """✅ <b><u>FunPay Cardinal инициализирован!</u></b>\n
ℹ️ <b><i>Версия:</i></b> <code>{}</code>
👑 <b><i>Аккаунт:</i></b>  <code>{}</code> | <code>{}</code>
💰 <b><i>Баланс:</i></b> <code>{}₽, {}$, {}€</code>
📊 <b><i>Активные заказы:</i></b>  <code>{}</code>

💬 <b><i>Telegram чат:</i></b> @funpay_cardinal
🔄 <b><i>Обновления:</i></b> @fpc_updates
🧩 <b><i>Плагины:</i></b> @fpc_plugins
👨‍💻 <b><i>Разработчик:</i></b> @woopertail, @sidor0912
🤑 <b><i>Донат:</i></b> @sidor_donate"""

create_test_ad_key = "Введи название лота, авто-выдачу которого ты хочешь протестировать."

test_ad_key_created = """✅ Создан одноразовый ключ для выдачи <code>{}</code>.\n
Отправь команду снизу в чат с пользователем, которому хочешь выдать товар.\n
<code>!автовыдача {}</code>"""

about = """<b>🐦 FunPay Cardinal 🐦 v{}</b>\n
<i>Telegram чат:</i> @funpay_cardinal
<i>Обновления:</i> @fpc_updates
<i>Плагины:</i> @fpc_plugins
<i>Разработчик:</i> @woopertail, @sidor0912
<i>Донат:</i> @sidor_donate"""

sys_info = """<b><u>Сводка данных</u></b>

<b>ЦП:</b>
{}
    Используется <i>FPC</i>: <code>{}%</code>
    
<b>ОЗУ:</b>
    Всего:  <code>{} MB</code>
    Использовано:  <code>{} MB</code>
    Свободно:  <code>{} MB</code>
    Используется ботом:  <code>{} MB</code>
    
<b>Прочее:</b>
    Аптайм:  <code>{}</code>
    ID чата:  <code>{}</code>"""

act_blacklist = """Введи имя пользователя, которого хочешь добавить в ЧС."""
already_blacklisted = "❌ <code>{}</code> уже находится в ЧС."
user_blacklisted = "✅ <code>{}</code> добавлен в ЧС."
act_unban = "Введи имя пользователя, которого хочешь удалить из ЧС."
not_blacklisted = "❌ <code>{}</code> не в ЧС."
user_unbanned = "✅ <code>{}</code> удален из ЧС."
blacklist_empty = "❌ Черный список пуст."

act_proxy = "Введи прокси в формате <u>login:password@ip:port</u> или <u>ip:port</u>."
proxy_already_exists = "❌ Прокси <code>{}</code> уже добавлены."
proxy_added = "✅ Прокси <u>{}</u> добавлены успешно."
proxy_format = "❌ Прокси должны иметь формат <u>login:password@ip:port</u> или <u>ip:port</u>."
proxy_adding_error = "❌ Во время добавления прокси произошла какая-то ошибка."
proxy_undeletable = "❌ Эту прокси невозможно удалить, т.к. она используется сейчас."

act_edit_watermark = "Введи новый текст водяного знака. Например:\n{}\n<code>𝑭𝒖𝒏𝑷𝒂𝒚 𝑪𝒂𝒓𝒅𝒊𝒏𝒂𝒍</code>\n" \
                     "<code>FunPay Cardinal</code>\n<code>[FunPay / Cardinal]</code>\n<code>𝑭𝑷𝑪</code>\n" \
                     "<code>FPC</code>\n<code>🤖</code>\n<code>🐦</code>\n\n" \
                     "Примеры можно скопировать нажатием и отредактировать по своему желанию.\nУчти, что на FunPay эмодзи " \
                     "🐦 выглядит не так, как в Telegram." \
                     "\n\nЕсли нужно удалить водяной знак, отправь <code>-</code>."
watermark_changed = "✅ Водяной знак сообщений изменен."
watermark_deleted = "✅ Водяной знак сообщений удален."
watermark_error = "❌ Невалидный водяной знак."

logfile_not_found = "❌ Лог-файл не обнаружен."
logfile_sending = "Отправлю лог-файл (это может занять какое-то время)..."
logfile_error = "❌ Не удалось отправить лог-файл."
logfile_deleted = "🗑️ Удалено {} лог-файл(-а, -ов)."

update_no_tags = "❌ Не удалось получить список версий. Попробуй позже."
update_lasted = "✅ У тебя стоит последняя версия FunPayCardinal {}"
update_get_error = "❌ Не удалось получить информацию о новой версии. Попробуй позже."
update_available = "<b><u>Доступна новая версия!</u></b>\n\n\n{}\n\n{}"
update_update = "Чтобы обновиться, введи команду /update"
update_backup = "✅ Резервная копия конфигов, хранилища и плагинов <code>backup.zip</code>.\n\n" \
                "⚠️ НЕ ОТПРАВЛЯЙ этот архив НИКОМУ. Он содержит абсолютно ВСЁ содержимое и настройки бота (в том числе golden_key и товарные файлы)."
update_backup_error = "❌ Не удалось создать бэкап конфигов, хранилища и плагинов."
update_backup_not_found = "❌ Резервная копия не обнаружена."
update_downloaded = "✅ Загрузил обновление {} (пропущено {} шт.). Устанавливаю..."
update_download_error = "❌ Произошла ошибка при загрузке обновления."
update_done = "✅ Установил обновление! Перезапусти <i>FPC</i> с помощью команды /restart"
update_done_exe = "✅ Установил обновление! Новый <code>FPC.exe</code> находится в папке <code>update</code>. " \
                  "Выключи <i>FPC</i>, перенеси новый <code>FPC.exe</code> на место старого " \
                  "и запусти <code>Start.bat</code>."
update_install_error = "❌ Произошла ошибка при установке обновления."

restarting = "Перезагружаюсь..."
power_off_0 = """<b><u>Ты уверен, что хочешь выключить меня?</u></b>\n
Включить меня через <i>Telegram</i> ПУ <b><u>не получится!</u></b>"""
power_off_1 = "На всякий случай спрошу еще раз.\n\n<b><u>Ты точно уверен?</u></b>"
power_off_2 = """Просто для протокола:
тебе придется заходить на сервер или подходить к компьютеру (ну или где я там у тебя) и запускать меня вручную!"""
power_off_3 = """Не то чтобы я навязываюсь, но если ты хочешь применить изменения основного конфига, ты можешь 
просто перезапустить меня командой /restart."""
power_off_4 = "Ты вообще читаешь мои сообщения? Проверим ка тебя на внимательность: да = нет, нет = да." \
              "Уверен, ты даже не читаешь мои сообщения, а ведь важную инфу тут пишу."
power_off_5 = "Ну то есть твердо и четко, дэ?"
power_off_6 = "Ладно, ладно, выключаюсь..."
power_off_cancelled = "Выключение отменено."
power_off_error = "❌ Данная кнопка не принадлежит этому запуску.\nВызови это меню снова."

enter_msg_text = "Введи текст сообщения."
msg_sent = "✅ Сообщение отправлено в чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>."
msg_sending_error = "❌ Не удалось отправить сообщение в чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>."
send_img = "Отправь мне изображение."

greeting_changed = "✅ Текст приветствия изменен."
greeting_cooldown_changed = "✅ Кулдаун приветственного сообщения изменен: {} дн."
order_confirm_changed = "✅ Текст ответа на подтверждение заказа изменен!"
review_reply_changed = "✅ Текст ответа на отзыв с {} изменен!"
review_reply_empty = "❌ Ответ на отзыв с {} не установлен."
review_reply_text = "Ответ на отзыв с {}:\n<code>{}</code>"

get_chat_error = "❌ Не удалось получить данные о чате."
viewing = "Смотрит"
you = "Ты"
support = "тех. поддержка"
photo = "Фотография"

refund_attempt = "❌ Не удалось вернуть средства по заказу <code>#{}</code>.\nОсталось попыток: <code>{}</code>."
refund_error = "❌ Не удалось вернуть средства по заказу <code>#{}</code>."
refund_complete = "✅ Средства по заказу <code>#{}</code> возвращены."

updating_profile = "Обновляю статистику аккаунта (это может занять некоторое время)..."
profile_updating_error = "❌ Не удалось обновить статистику аккаунта."

act_change_golden_key = "Введите golden_key"
cookie_changed = "✅ golden_key успешно изменен{}.\n"
cookie_changed2 = "Перезапустите бота командой /restart."
cookie_incorrect_format = "❌ Неверный формат golden_key. Попробуй ещё раз."
cookie_error = "❌ Не удалось авторизоваться. Возможно, введен неверный golden_key?"

ad_lot_not_found_err = "❌ Не удалось обнаружить лот с индексом <code>{}</code>."
ad_already_ad_err = "❌ У лота <code>{}</code> уже настроена авто-выдача."
ad_lot_already_exists = "❌ К лоту <code>{}</code> уже привязана авто-выдача."
ad_lot_linked = "✅ Авто-выдача привязана к лоту <code>{}</code>."
ad_link_gf = "Введи название товарного файла.\nЕсли ты хочешь отвязать товарный файл, отправь <code>-</code>\n\n" \
             "Если файла не существует, он будет создан автоматически."
ad_gf_unlinked = "✅ Товарный файл успешно отвязан от лота <code>{}</code>."
ad_gf_linked = "✅ Товарный файл <code>storage/products/{}</code> привязан к лоту <code>{}</code>."
ad_gf_created_and_linked = "✅ Товарный файл <code>storage/products/{}</code> <b><u>создан</u></b> и привязан к лоту <code>{}</code>."
ad_creating_gf = "🔄 Создаю товарный файл <code>storage/products/{}</code>..."
ad_product_var_err = "❌ К лоту <code>{}</code> привязан товарный файл, однако в тексте выдачи отсутствует переменная <code>$product</code>."
ad_product_var_err2 = "❌ Невозможно привязать товарный файл, т.к. в тексте выдачи отсутствует переменная <code>$product</code>."
ad_text_changed = "✅ Текст выдачи лота <code>{}</code> изменен на <code>{}</code>."
ad_updating_lots_list = "Обновляю данные о лотах и категориях (это может занять некоторое время)..."
ad_lots_list_updating_err = "❌ Не удалось обновить данные о лотах и категориях."
gf_not_found_err = "❌ Не удалось обнаружить товарный файл с индексом <code>{}</code>."
copy_lot_name = "Отправь название лота в точности как на FunPay."

act_create_gf = "Введи название нового товарного файла."
gf_name_invalid = "❌ Невалидное название файла.\n\n" \
                  "В названии допустимы только <b><u>английские</u></b> " \
                  "и <b><u>русские</u></b> символы, а так же <code>_</code>, <code>-</code> и <code>пробел</code>."
gf_already_exists_err = "❌ Файл <code>{}</code> уже существует."
gf_creation_err = "❌ Произошла ошибка при создании файла <code>{}</code>."
gf_created = "✅ Товарный файл <code>storage/products/{}</code> создан."
gf_amount = "Товаров в файле"
gf_uses = "Используется в лотах"
gf_send_new_goods = "Отправь товары, которые хочешь добавить в товарный файл.\n\nКаждая новая строка (<code>Shift+Enter</code>) - новый товар."
gf_add_goods_err = "❌ Не удалось добавить товары в файл."
gf_new_goods = "✅ <code>{}</code> товар(-а / -ов) добавлен(-о) в файл  <code>storage/products/{}</code>."
gf_empty_error = "❌ Файл storage/products/{} пуст."
gf_linked_err = "❌ Файл <code>storage/products/{}</code> привязан к одному или нескольким лотам.\n" \
                "Перед удалением этого товарного файла отвяжи его от всех лотов."
gf_deleting_err = "❌ Не удалось удалить файл <code>storage/products/{}</code>."

ar_cmd_not_found_err = "❌ Не удалось обнаружить команду с индексом <code>{}</code>."
ar_subcmd_duplicate_err = "❌ В сете команд дублируется команда <code>{}</code>."
ar_cmd_already_exists_err = "❌ Команда <code>{}</code> уже существует."
ar_enter_new_cmd = "Введи новую команду (или несколько команд через знак <code>|</code>)."
ar_cmd_added = "Добавлена новая команда <code>{}</code>."
ar_response_text = "Текст ответа"
ar_notification_text = "Текст уведомления"
ar_response_text_changed = "✅ Текст ответа команды <code>{}</code> изменен на <code>{}</code>."
ar_notification_text_changed = "✅ Текст уведомления команды <code>{}</code> изменен на <code>{}</code>."

cfg_main = "Основной конфиг.\n\n⚠️ НЕ ОТПРАВЛЯЙ этот файл НИКОМУ."
cfg_ar = "Конфиг автоответа."
cfg_ad = "Конфиг авто-выдачи."
cfg_not_found_err = "❌ Конфиг {} не обнаружен."
cfg_empty_err = "❌ Конфиг {} не обнаружен."

tmplt_not_found_err = "❌ Не удалось обнаружить заготовку с индексом <code>{}</code>."
tmplt_already_exists_err = "❌ Такая заготовка уже существует."
tmplt_added = "✅ Заготовка добавлена."
tmplt_msg_sent = "✅ Сообщение отправлено в чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>.\n\n<code>{}</code>"

pl_not_found_err = "❌ Не удалось найти плагин с UUID <code>{}</code>."
pl_file_not_found_err = "❌ Не удалось обнаружить файл <code>{}</code>.\nПерезагрузите <i>FPC</i> с помощью команды /restart."
pl_commands_list = "Команды плагина <b><i>{}</i></b>."
pl_author = "Автор"
pl_new = "Отправь мне плагин.\n\n<b>⚠️ ВНИМАНИЕ! Загрузка плагинов из сомнительных источников может привести к печальным последствиям.\n" \
         "@fpc_plugins решает большинство возможных проблем.</b>"

au_user_settings = "Настройки для пользователя {}"
adv_fpc = "😎 FunPay Cardinal - лучший бот для FunPay"
adv_description = """🐦 𝑭𝒖𝒏𝑷𝒂𝒚 𝑪𝒂𝒓𝒅𝒊𝒏𝒂𝒍 v{}🐦

🤖 Автовыдача товаров
🚀 Автоподнятие лотов
💬 Автоответ на заготовленные команды
🔄 Автовосстановление лотов после продажи
📦 Автодеактивация лотов, если товары закончились
🔝 Вечный онлайн
📲 Уведомления в Telegram
🕹️ Полноценная панель управления в Telegram
🧩 Плагины
🌟 И многое другое...

🛠️ Сделано с помощью: github.com/sidor0912/FunPayCardinal
👨‍💻 Автор: @woopertail, @sidor0912
💰 Донат: @sidor_donate
🔄 Обновления: @fpc_updates
🧩 Плагины: @fpc_plugins
💬 Чат: @funpay_cardinal"""

# - Описания меню
desc_main = "Выбери категорию настроек."
desc_lang = desc_main
desc_gs = "Здесь ты можешь включать и выключать основные функции <i>FPC</i>."
desc_ns = """Здесь ты можешь настроить уведомления.\n
<b><u>Настройки раздельны для каждого <i>Telegram</i> чата!</u></b>\n
ID текущего чата: <code>{}</code>"""
desc_bl = "Здесь ты можешь установить ограничения для пользователей из ЧС."
desc_ar = "Здесь ты можешь добавить команды или редактировать существующие."
desc_ar_list = "Выбери интересующую тебя команду / сет команд."

desc_ad = "Здесь ты можешь изменить настройки авто-выдачи, загрузить / выгрузить товарные файлы и т.д."
desc_ad_list = "Это список лотов, к которым привязана авто-выдача. Выбери интересующий тебя лот."
desc_ad_fp_lot_list = "Это список лотов с твоего профиля FunPay. Выбери интересующий тебя лот, чтобы привязать к нему авто-выдачу.\n" \
                      "Если в списке отсутствует какой-либо лот, нажми кнопку <code>🔄 Обновить</code>.\n\n" \
                      "Последнее сканирование: {}"
desc_gf = "Выбери интересующий тебя товарный файл."

desc_mv = "Здесь ты можешь настроить вид уведомлений о новых сообщениях."
desc_gr = "Здесь ты можешь настроить приветствие новых пользователей.\n\n<b>Текст приветствия:</b>\n<code>{}</code>"
desc_oc = "Здесь ты можешь настроить сообщение на подтверждение заказа.\n\n<b>Текст сообщения:</b>\n<code>{}</code>"
desc_or = "Здесь ты можешь настроить ответ на отзывы."
desc_an = "Здесь ты можешь настроить уведомления об объявлениях."
desc_cfg = "Здесь ты можешь загрузить и выгрузить конфиги."
desc_tmplt = "Здесь вы можете добавлять и удалять заготовки ответов."
desc_pl = "Здесь ты можешь получить информацию о плагинах, а так же настроить их.\n\n" \
          "⚠️ <b><u>После активации / деактивации / добавления / удаления плагина, необходимо " \
          "перезапустить бота!</u></b> (/restart)"
desc_au = "Здесь ты можешь настроить авторизацию в панели управления Telegram."
desc_proxy = "Здесь ты можешь настроить прокси."

# - Описание команд
cmd_menu = "открыть настройки"
cmd_language = "изменить язык"
cmd_profile = "статистика аккаунта"
cmd_golden_key = "изменить golden_key"
cmd_test_lot = "создать ключ выдачи"
cmd_upload_chat_img = "(чат) выгрузить изображение на FunPay"
cmd_upload_offer_img = "(лот) выгрузить изображение на FunPay"
cmd_upload_plugin = "выгрузить плагин"
cmd_ban = "добавить пользователя в ЧС"
cmd_unban = "удалить пользователя из ЧС"
cmd_black_list = "черный список"
cmd_watermark = "изменить водяной знак сообщений"
cmd_logs = "загрузить текущий лог-файл"
cmd_del_logs = "удалить старые лог-файлы"
cmd_about = "об текущей версии"
cmd_check_updates = "проверить на наличие обновлений"
cmd_update = "обновиться до след. версии"
cmd_sys = "информация о нагрузке на систему"
cmd_create_backup = "создать бэкап"
cmd_get_backup = "получить бэкап"
cmd_restart = "перезапустить FPC"
cmd_power_off = "выключить FPC"

# - Описание переменных
v_edit_greeting_text = "Введи текст приветственного сообщения."
v_edit_greeting_cooldown = "Введи кулдаун приветственного сообщения (в днях)."
v_edit_order_confirm_text = "Введи текст ответа на подтверждение заказа."
v_edit_review_reply_text = "Введи текст ответа на отзыв с {}."
v_edit_delivery_text = "Введи новый текст выдачи."
v_edit_response_text = "Введи новый текст ответа."
v_edit_notification_text = "Введи новый текст Telegram уведомления."
V_new_template = "Введи текст новой заготовки ответа."
v_list = "Список переменных"
v_date = "<code>$date</code> - текущая дата в формате <i>ДД.ММ.ГГГГ</i>."
v_date_text = "<code>$date_text</code> - текущая дата в формате <i>1 января</i>."
v_full_date_text = "<code>$full_date_text</code> - текущая дата в формате <i>1 января 2001 года</i>."
v_time = "<code>$time</code> - текущее время в формате <i>ЧЧ:ММ</i>."
v_full_time = "<code>$full_time</code> - текущее время в формате <i>ЧЧ:ММ:СС</i>."
v_photo = "<code>$photo=[PHOTO ID]</code> - фотография. Вместо <code>[PHOTO ID]</code> " \
          "впиши ID фотографии, полученный с помощью команды /upload_chat_img"
v_sleep = "<code>$sleep=[TIME]</code> - задержка. Вместо <code>[TIME]</code> " \
          "впиши время задержки в секундах."
v_order_id = "<code>$order_id</code> - ID заказа (без #)"
v_order_link = "<code>$order_link</code> - ссылка на заказ"
v_order_title = "<code>$order_title</code> - название заказа."
v_order_params = "<code>$order_params</code> - параметры заказа."
v_order_desc_and_params = "<code>$order_desc_and_params</code> - название заказа и/или параметры."
v_order_desc_or_params = "<code>$order_desc_or_params</code> - название заказа или параметры."
v_game = "<code>$game</code> - название игры."
v_category = "<code>$category</code> - название подкатегории."
v_category_fullname = "<code>$category_fullname</code> - полное название подкатегории (название подкатегории + название игры)."
v_product = "<code>$product</code> - товар(-ы), полученный(-е) из товарного файла. " \
            "Если товарный файл не привязан - не будет заменяться."
v_chat_id = "<code>$chat_id</code> - ID чата."
v_chat_name = "<code>$chat_name</code> - название чата."
v_message_text = "<code>$message_text</code> - текст сообщения собеседника."
v_username = "<code>$username</code> - никнейм собеседника."

# Текста исключений
exc_param_not_found = "Параметр \"{}\" не найден."
exc_param_cant_be_empty = "Значение параметра \"{}\" не может быть пустым."
exc_param_value_invalid = "Недопустимое значение параметра \"{}\". Допустимые значения: {}. Текущее значение: \"{}\"."
exc_goods_file_not_found = "Указанный товарный файл \"{}\" не найден."
exc_goods_file_is_empty = "В файле \"{}\" отсутствуют товары."
exc_not_enough_items = "В файле \"{}\" недостаточно товаров. Запрошено: {}, доступно: {}."
exc_no_product_var = "Указан \"productsFileName\", но в параметре \"response\" отсутствует переменная $product."
exc_no_section = "Секция отсутствует."
exc_section_duplicate = "Обнаружен дубликат секции."
exc_cmd_duplicate = "Команда или суб-команда \"{}\" уже существует."
exc_cfg_parse_err = "Ошибка в конфиге {}, в секции [{}]: {}"
exc_plugin_field_not_found = "Не удалось загрузить плагин \"{}\": отсутствует обязательное поле \"{}\"."

# Логи
log_tg_initialized = "$MAGENTATelegram бот инициализирован."
log_tg_started = "$CYANTelegram бот $YELLOW@{}$CYAN запущен."
log_tg_handler_error = "Произошла ошибка при выполнении хэндлера Telegram бота."
log_tg_update_error = "Произошла ошибка ({}) при получении обновлений Telegram (введен некорректный токен?)."
log_tg_notification_error = "Произошла ошибка при отправке уведомления в чат $YELLOW{}$RESET."
log_access_attempt = "$MAGENTA@{} (ID: {})$RESET попытался получить доступ к ПУ. Сдерживаю его как могу!"
log_click_attempt = "$MAGENTA@{} (ID: {})$RESET нажимает кнопки ПУ в чате $MAGENTA@{} (ID: {})$RESET. У него ничего не выйдет!"
log_access_granted = "$MAGENTA@{} (ID: {})$RESET получил доступ к ПУ."
log_new_ad_key = "$MAGENTA@{} (ID: {})$RESET создал ключ для выдачи $YELLOW{}$RESET: $CYAN{}$RESET."
log_user_blacklisted = "$MAGENTA@{} (ID: {})$RESET добавил $YELLOW{}$RESET в ЧС."
log_user_unbanned = "$MAGENTA@{} (ID: {})$RESET удалил $YELLOW{}$RESET из ЧС."
log_watermark_changed = "$MAGENTA@{} (ID: {})$RESET изменил водяной знак сообщений на $YELLOW{}$RESET."
log_watermark_deleted = "$MAGENTA@{} (ID: {})$RESET удалил водяной знак сообщений."
log_greeting_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст приветствия на $YELLOW{}$RESET."
log_greeting_cooldown_changed = "$MAGENTA@{} (ID: {})$RESET изменил кулдаун приветсвенного сообщения на $YELLOW{}$RESET дн."
log_order_confirm_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст ответа на подтверждение заказа на $YELLOW{}$RESET."
log_review_reply_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст ответа на отзыв с {} зв. на $YELLOW{}$RESET."
log_param_changed = "$MAGENTA@{} (ID: {})$RESET изменил параметр $CYAN{}$RESET секции $YELLOW[{}]$RESET на $YELLOW{}$RESET."
log_notification_switched = "$MAGENTA@{} (ID: {})$RESET переключил уведомления $YELLOW{}$RESET для чата $YELLOW{}$RESET на $CYAN{}$RESET."
log_ad_linked = "$MAGENTA@{} (ID: {})$RESET привязал авто-выдачу к лоту $YELLOW{}$RESET."
log_ad_text_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст выдачи лота $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ad_deleted = "$MAGENTA@{} (ID: {})$RESET удалил авто-выдачу лота $YELLOW{}$RESET."
log_gf_created = "$MAGENTA@{} (ID: {})$RESET создал товарный файл $YELLOWstorage/products/{}$RESET."
log_gf_unlinked = "$MAGENTA@{} (ID: {})$RESET отвязал товарный файл от лота $YELLOW{}$RESET."
log_gf_linked = "$MAGENTA@{} (ID: {})$RESET привязал товарный файл $YELLOWstorage/products/{}$RESET к лоту $YELLOW{}$RESET."
log_gf_created_and_linked = "$MAGENTA@{} (ID: {})$RESET создал и привязал товарный файл $YELLOWstorage/products/{}$RESET к лоту $YELLOW{}$RESET."
log_gf_new_goods = "$MAGENTA@{} (ID: {})$RESET добавил $CYAN{}$RESET товар(-a, -oв) в файл $YELLOWstorage/products/{}$RESET."
log_gf_downloaded = "$MAGENTA@{} (ID: {})$RESET запросил товарный файл $YELLOWstorage/products/{}$RESET."
log_gf_deleted = "$MAGENTA@{} (ID: {})$RESET удалил товарный файл $YELLOWstorage/products/{}$RESET."
log_ar_added = "$MAGENTA@{} (ID: {})$RESET добавил новую команду $YELLOW{}$RESET."
log_ar_response_text_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст ответа команды $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ar_notification_text_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст уведомления команды $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ar_cmd_deleted = "$MAGENTA@{} (ID: {})$RESET удалил команду $YELLOW{}$RESET."
log_cfg_downloaded = "$MAGENTA@{} (ID: {})$RESET запросил конфиг $YELLOW{}$RESET."
log_tmplt_added = "$MAGENTA@{} (ID: {})$RESET добавил заготовку ответа $YELLOW\"{}\"$RESET."
log_tmplt_deleted = "$MAGENTA@{} (ID: {})$RESET удалил заготовку ответа $YELLOW\"{}\"$RESET."
log_pl_activated = "$MAGENTA@{} (ID: {})$RESET активировал плагин $YELLOW\"{}\"$RESET."
log_pl_deactivated = "$MAGENTA@{} (ID: {})$RESET деактивировал плагин $YELLOW\"{}\"$RESET."
log_pl_deleted = "$MAGENTA@{} (ID: {})$RESET удалил плагин $YELLOW\"{}\"$RESET."
log_pl_delete_handler_err = "Произошла ошибка при выполнении хэндлера удаления плагина $YELLOW\"{}\"$RESET."

# Логи хэндлеров
log_new_msg = "$MAGENTA┌──$RESET Новое сообщение в переписке с пользователем $YELLOW{} (CID: {}):"
log_sending_greetings = "Пользователь $YELLOW{} (CID: {})$RESET написал впервые! Отправляю приветственное сообщение..."
log_new_cmd = "Получена команда $YELLOW{}$RESET в чате с пользователем $YELLOW{} (CID: {})$RESET."
ntfc_new_order = "💰 <b>Новый заказ:</b> <code>{}</code>\n\n<b><i>🙍‍♂️ Покупатель:</i></b>  <code>{}</code>\n" \
                 "<b><i>💵 Сумма:</i></b>  <code>{}</code>\n<b><i>📇 ID:</i></b> <code>#{}</code>\n\n<i>{}</i>"
ntfc_new_order_not_in_cfg = "ℹ️ Товар не будет выдан, т.к. к лоту не привязана авто-выдача."
ntfc_new_order_ad_disabled = "ℹ️ Товар не будет выдан, т.к. авто-выдача отключена в глобальных переключателях."
ntfc_new_order_ad_disabled_for_lot = "ℹ️ Товар не будет выдан, т.к. авто-выдача отключена для данного лота."
ntfc_new_order_user_blocked = "ℹ️ Товар не будет выдан, т.к. пользователь находится в ЧС и включена блокировка авто-выдачи."
ntfc_new_order_will_be_delivered = "ℹ️ Товар будет выдан в ближайшее время."
ntfc_new_review = "🔮 Вы получили {} за заказ <code>{}</code>!\n\n💬<b>Отзыв:</b>\n<code>{}</code>{}"
ntfc_review_reply_text = "\n\n🗨️<b>Ответ:</b> \n<code>{}</code>"

# Логи кардинала
crd_proxy_detected = "Обнаружен прокси."
crd_checking_proxy = "Выполняю проверку прокси..."
crd_proxy_err = "Не удалось подключиться к прокси. Убедитесь, что данные введены верно."
crd_proxy_success = "Прокси успешно проверен! IP-адрес: $YELLOW{}$RESET."
crd_acc_get_timeout_err = "Не удалось загрузить данные об аккаунте: превышен тайм-аут ожидания."
crd_acc_get_unexpected_err = "Произошла непредвиденная ошибка при получении данных аккаунта."
crd_try_again_in_n_secs = "Повторю попытку через {} секунд(-у/-ы)..."
crd_getting_profile_data = "Получаю данные о лотах и категориях..."
crd_profile_get_timeout_err = "Не удалось загрузить данные о лотах аккаунта: превышен тайм-аут ожидания."
crd_profile_get_unexpected_err = "Произошла непредвиденная ошибка при получении данных о лотах и категориях."
crd_profile_get_too_many_attempts_err = "Произошло ошибка при получении данных о лотах и категориях: превышено кол-во попыток ({})."
crd_profile_updated = "Обновил информацию о лотах $YELLOW({})$RESET и категориях $YELLOW({})$RESET профиля."
crd_tg_profile_updated = "Обновил информацию о лотах $YELLOW({})$RESET и категориях $YELLOW({})$RESET профиля (TG ПУ)."
crd_raise_time_err = 'Не удалось поднять лоты категории $CYAN\"{}\"$RESET. FunPay говорит: "{}". Следующая попытка через {}.'
crd_raise_unexpected_err = "Произошла непредвиденная ошибка при попытке поднять лоты категории $CYAN\"{}\"$RESET. Пауза на 10 секунд..."
crd_raise_status_code_err = "Ошибка {} при поднятии лотов категории $CYAN\"{}\"$RESET. Пауза на 1 мин..."
crd_lots_raised = "Все лоты категории $CYAN\"{}\"$RESET подняты!"
crd_raise_wait_3600 = "Следующая попытка через {}."
crd_msg_send_err = "Произошла ошибка при отправке сообщения в чат $YELLOW{}$RESET."
crd_msg_attempts_left = "Осталось попыток: $YELLOW{}$RESET."
crd_msg_no_more_attempts_err = "Не удалось отправить сообщение в чат $YELLOW{}$RESET: превышено кол-во попыток."
crd_msg_sent = "Отправил сообщение в чат $YELLOW{}."
crd_session_timeout_err = "Не удалось обновить сессию: превышен тайм-аут ожидания."
crd_session_unexpected_err = "Произошла непредвиденная ошибка при обновлении сессии."
crd_session_no_more_attempts_err = "Не удалось обновить сессию: превышено кол-во попыток."
crd_session_updated = "Сессия обновлена."
crd_raise_loop_started = "$CYANЦикл автоподнятия лотов запущен (это не значит, что автоподнятие лотов включено)."
crd_raise_loop_not_started = "$CYANЦикл автоподнятия не был запущен, т.к. на аккаунте не обнаружен лотов."
crd_session_loop_started = "$CYANЦикл обновления сессии запущен."
crd_no_plugins_folder = "Папка с плагинами не обнаружена."
crd_no_plugins = "Плагины не обнаружены."
crd_plugin_load_err = "Не удалось загрузить плагин {}."
crd_invalid_uuid = "Не удалось загрузить плагин {}: невалидный UUID."
crd_uuid_already_registered = "UUID {} ({}) уже зарегистрирован."
crd_handlers_registered = "Хэндлеры из $YELLOW{}.py$RESET зарегистрированы."
crd_handler_err = "Произошла ошибка при выполнении хэндлера."
crd_tg_au_err = "Не удалось изменить сообщение с информацией о пользователе: {}. Попробую без ссылки."
