# Глобальні
gl_next = "▶️ Далі"
gl_back = "◀️ Назад"
gl_yes = "✅ Так"
gl_yep = "✅ угу"
gl_no = "❌ Ні"
gl_cancel = "❌ Скасувати"
gl_error = "⚠️ Помилка"
gl_try_again = "Спробуй знову"
gl_error_try_again = f"{gl_error}. {gl_try_again}."
gl_refresh = "🔄 Оновити"
gl_delete = "🗑️ Видалити"
gl_edit = "✏️ Редагувати"
gl_configure = "⚙️ Налаштувати"
gl_pcs = "шт."
gl_last_update = "Останнє оновлення"

# - Головне меню
mm_language = "🗣️ Мова"
mm_global = "⚙️ Глобальні перемикачі"
mm_notifications = "🔔 Налаштування сповіщень"
mm_autoresponse = "🤖 Налаштування автовідповіді"
mm_autodelivery = "📦 Налаштування авто-видачі"
mm_blacklist = "🚫 Налаштування чорного списку"
mm_templates = "📝 Шаблони відповідей"
mm_greetings = "👋 Привітальне повідомлення"
mm_order_confirm = "✅ Відповідь на підтвердження замовлення"
mm_review_reply = "⭐ Відповідь на відгуки"
mm_new_msg_view = "✉️ Вид спов. про нові повідомлення"
mm_plugins = "🧩 Плагіни"
mm_configs = "📁 Конфіги"
mm_authorized_users = "👥 Авторизовані користувачі"
mm_proxy = "🌐 Проксі"

# Глобальні перемикачі
gs_autoraise = "{} Автопідняття"
gs_autoresponse = "{} Автовідповідач"
gs_autodelivery = "{} Авто-видача"
gs_nultidelivery = "{} Мульти-видача"
gs_autorestore = "{} Відновлення лотів"
gs_autodisable = "{} Деактивація лотів"
gs_old_msg_mode = "{} Старий режим отримання повідомлень"
gs_keep_sent_messages_unread = "{} Залишати непрочитаним при відправці"

# Налаштування сповіщень
ns_new_msg = "{} Нове повідомлення"
ns_cmd = "{} Отримано команду"
ns_new_order = "{} Нове замовлення"
ns_order_confirmed = "{} Замовлення підтверджено"
ns_lot_activate = "{} Відновлення лота"
ns_lot_deactivate = "{} Деактивація лота"
ns_delivery = "{} Видача товару"
ns_raise = "{} Підняття лотів"
ns_new_review = "{} Залишений відгук"
ns_bot_start = "{} Запуск бота"
ns_other = "{} Інше (плагіни)"

# Налаштування автовідповіді
ar_edit_commands = "✏️ Редагувати існуючі команди"
ar_add_command = "➕ Додати команду / сет команд"
ar_to_ar = "🤖 У налаштування автовідповідача"
ar_to_mm = "📋 У головне меню"
ar_edit_response = "✏️ Редагувати відповідь"
ar_edit_notification = "✏️ Редагувати сповіщення"
ar_notification = "{} Сповіщення в Telegram"
ar_add_more = "➕ Додати ще"
ar_add_another = "➕ Додати іншу"

# Налаштування авто-видачі
ad_edit_autodelivery = "🗳️ Редагувати авто-видачу лотів"
ad_add_autodelivery = "➕ Прив'язати авто-видачу до лоту"
ad_add_another_ad = "➕ Прив'язати інший"
ad_add_more_ad = "➕ Прив'язати ще"
ad_edit_goods_file = "📋 Редагувати товарні файли"
ad_upload_goods_file = "⤴️ Вивантажити товарний файл"
ad_create_goods_file = "➕ Створити товарний файл"
ad_to_ad = "📦 У налаштування авто-видачі"
ad_to_mm = "📋 У головне меню"

# - Редагувати авто-видачу
ea_edit_delivery_text = "✏️ Редагувати текст видачі"
ea_link_goods_file = "⛓️ Прив'язати товарний файл"
ea_delivery = "{} Авто-видача"
ea_multidelivery = "{} Мультивидача"
ea_restore = "{} Відновлення"
ea_deactivate = "{} Деактивація"
ea_test = "🗝️ Ключ видачі"
ea_more_test = "🗝️ Ще 1 ключ"
ea_link_another_gf = "⛓️ Інший файл"

# - Додати авто-видачу
fl_manual = "➕ Ввести вручну"

# - Товарні файли
gf_add_goods = "➕ Додати товари"
gf_download = "⤵️ Завантажити"
gf_create_another = "➕ Створити інший"
gf_create_more = "➕ Створити ще"
gf_add_more = "➕ Додати ще"
gf_try_add_again = "➕ Ще раз"

# Налаштування чорного списку
bl_autodelivery = "{} Не видавати товар"
bl_autoresponse = "{} Не відповідати на команди"
bl_new_msg_notifications = "{} Не спов. про нові повідомлення"
bl_new_order_notifications = "{} Не спов. про нові замовлення"
bl_command_notifications = "{} Не спов. про отримані команди"

# Шаблони відповідей
tmplt_add = "➕ Додати шаблон"
tmplt_add_more = "➕ Додати ще"
tmplt_add_another = "➕ Додати іншу"

# Налаштування привітання
gr_greetings = "{} Вітати користувачів"
gr_ignore_sys_msgs = "{} Ігнорувати системні повідомлення"
gr_edit_message = "✏️ Змінити текст привітального повідомлення"
gr_edit_cooldown = "⏱️ Кулдаун: {} дн."

# Налаштування відповіді на підтвердження замовлення
oc_watermark = "{} Водяний знак повідомлень"
oc_send_reply = "{} Відправляти повідомлення"
oc_edit_message = "✏️ Змінити текст повідомлення"

# Налаштування виду сповіщень про нові повідомлення
mv_incl_my_msg = "{} Відображати мої повідомлення"
mv_incl_fp_msg = "{} Відображати повідомлення FunPay"
mv_incl_bot_msg = "{} Відображати повідомлення бота"
mv_only_my_msg = "{} Спов., якщо пов. тільки від мене"
mv_only_fp_msg = "{} Спов., якщо пов. тільки від FP"
mv_only_bot_msg = "{} Спов., якщо пов. тільки від бота"
mv_show_image_name = "{} Відображати назви зображень"

# Плагіни
pl_add = "➕ Додати плагін"
pl_activate = "Активувати"
pl_deactivate = "Деактивувати"
pl_commands = "⌨️ Команди"
pl_settings = "⚙️ Налаштування"

# Конфіги
cfg_download_main = "⤵️ Завантажити основний конфіг"
cfg_download_ar = "⤵️ Завантажити конфіг автовідповіді"
cfg_download_ad = "⤵️ Завантажити конфіг авто-видачі"
cfg_upload_main = "⤴️ Вивантажити основний конфіг"
cfg_upload_ar = "⤴️ Вивантажити конфіг автовідповіді"
cfg_upload_ad = "⤴️ Вивантажити конфіг авто-видачі"

# Авторизовані користувачі
tg_block_login = "{} Блокувати входи за паролем"

# Проксі
prx_proxy_add = "➕ Додати проксі"

# Посилання
lnk_github = "🛠️ Створити свого бота FunPay"
lnk_updates = "🔄 Оновлення"
lnk_chat = "💬 Чат"

# Оголошення
an_an = "{} Оголошення"
an_ad = "{} Реклама"

# Нове замовлення
ord_refund = "💸 Повернути гроші"
ord_open = "🌐 Відкрити сторінку замовлення"
ord_answer = "📨 Відповісти"
ord_templates = "📝 Шаблони"

# Нове повідомлення
msg_reply = "📨 Відповідь"
msg_reply2 = "📨 Відправити ще"
msg_templates = "📝 Шаблони"
msg_more = "➕ Більше"

# Текст повідомлень
access_denied = "👋 Привіт, <b><i>{}</i></b>!\n\n❌ Ти неавторизований користувач.\n\n" \
                "🔑 Відправ мені <u><b>секретний пароль</b></u>, який ти ввів при первинному налаштуванні, " \
                "щоб почати роботу."

access_granted = "🔓 Доступ до ПУ надано!\n\n" \
                 "🔕 Врахуй, що зараз я <b><u>не відправляю жодних сповіщень в цей чат</u></b>.\n\n" \
                 "🔔 Ти можеш налаштувати сповіщення для <b><u>цього чату</u></b> у меню налаштувань.\n\n" \
                 "⚙️ Щоб відкрити меню налаштувань <i>FunPay Cardinal</i>, введи команду /menu."

access_granted_notification = "<b>🚨 УВАГА! 🚨\n\n\n</b>" * 3 + "\n\n\n🔐 \"<a href=\"tg://user?id={1}\"> {0} </a>\" " \
                                                              "<b>(ID: {1}) щойно отримав доступ до ПУ Telegram! 🔓</b>"

param_disabled = "❌ Даний параметр вимкнено глобально і не може бути змінений для цього лота.\n\n" \
                 "❔ Перемикання глобальних параметрів доступне у меню глобальних перемикачів " \
                 "(/menu -> ⚙️ Глобальні перемикачі)."

old_mode_help = """<b>Новий режим отримання повідомлень</b>
✅ <i>FPC</i> отримує повну історію чату і бачить усі дані про всі нові повідомлення.
✅ <i>FPC</i> може бачити зображення в чаті і пересилати їх в <i>Telegram</i> чат.
✅ <i>FPC</i> може точно визначити, хто саме написав, чи то ти, твій співрозмовник або 3я особа (арбітраж).
❌ Через те що <i>FPC</i> отримує повну історію чату для виявлення нових повідомлень, чат стає "прочитаним" (не загоряється оранжевим).

<b>Старий режим отримання повідомлень</b>
✅ Непрочитані особисто тобою чати залишаються непрочитаними (загоряються оранжевим кольором).
✅ Працює трохи швидше нового.
❌ <i>FPC</i> не отримує повну історію чату, внаслідок чого бачить лише останнє повідомлення, а не всі. Якщо користувач швидко напише кілька повідомлень, <i>FPC</i> побачить лише останнє.
❌ <i>FPC</i> не може бачити зображення в чаті і пересилати їх у <i>Telegram</i> чат.
❌ <i>FPC</i> не може точно визначити, хто саме написав: ти чи співрозмовник. Якщо чат не прочитано, значить повідомлення від співрозмовника, інакше - від тебе. Однак, якщо ти дивишся чат у момент отримання повідомлень, дана логіка іноді може збоїти. Так само <i>FPC</i> не зможе визначити, що в чат написала 3я особа (арбітраж).

❗ Якщо натиснути кнопку <code>Більше</code> у сповіщенні про нове повідомлення, <i>FPC</i> "прочитає" чат і покаже останні 15 повідомлень, в тому числі зображення. Так само <i>FPC</i> зможе визначити, хто саме автор повідомлень."""

bot_started = """✅ Telegram-бот запущено!\n
✅ Ти <b><u>можеш налаштовувати конфіги</u></b> і повністю <b><u>використовувати функціонал <i>Telegram</i> бота</u></b>.\n
❌ <i>FunPay Cardinal</i> ще <b><u>не ініціалізовано</u></b> і <b><u>жодні його функції не працюють</u></b>.\n
🔄 Як тільки <i>FunPay Cardinal</i> ініціалізується, дане повідомлення зміниться.\n
📋 Якщо <i>FPC</i> довго не ініціалізується, перевір логи за допомогою команди /logs"""

fpc_init = """✅ <b><u>FunPay Cardinal ініціалізовано!</u></b>\n
ℹ️ <b><i>Версія:</i></b> <code>{}</code>
👑 <b><i>Акаунт:</i></b>  <code>{}</code> | <code>{}</code>
💰 <b><i>Баланс:</i></b> <code>{}₽, {}$, {}€</code>
📊 <b><i>Активні замовлення:</i></b>  <code>{}</code>

💬 <b><i>Telegram чат:</i></b> @funpay_cardinal
🔄 <b><i>Оновлення:</i></b> @fpc_updates
🧩 <b><i>Плагіни:</i></b> @fpc_plugins
👨‍💻 <b><i>Розробник:</i></b> @woopertail, @sidor0912
🤑 <b><i>Донат:</i></b> @sidor_donate"""

create_test_ad_key = "Введи назву лота, авто-видачу якого ти хочеш протестувати."

test_ad_key_created = """✅ Створений одноразовий ключ для видачі <code>{}</code>.\n
Надішли команду знизу в чат з користувачем, якому хочеш видати товар.\n
<code>!автовыдача {}</code>"""

about = """<b>🐦 FunPay Cardinal 🐦 v{}</b>\n
<i>Telegram чат:</i> @funpay_cardinal
<i>Оновлення:</i> @fpc_updates
<i>Плагіни:</i> @fpc_plugins
<i>Розробник:</i> @woopertail, @sidor0912
<i>Донат:</i> @sidor_donate"""

sys_info = """<b><u>Дані системи</u></b>

<b>ЦП:</b>
{}
    Використовується <i>FPC</i>: <code>{}%</code>

<b>ОЗП:</b>
    Всього:  <code>{} MB</code>
    Використано:  <code>{} MB</code>
    Вільно:  <code>{} MB</code>
    Використовує ботом:  <code>{} MB</code>

<b>Інше:</b>
    Аптайм:  <code>{}</code>
    ID чату:  <code>{}</code>"""

act_blacklist = """Введи ім'я користувача, якого хочеш додати в ЧС."""
already_blacklisted = "❌ <code>{}</code> вже знаходиться в ЧС."
user_blacklisted = "✅ <code>{}</code> доданий в ЧС."
act_unban = "Введи ім'я користувача, якого хочеш видалити з ЧС."
not_blacklisted = "❌ <code>{}</code> не в ЧС."
user_unbanned = "✅ <code>{}</code> видалений з ЧС."
blacklist_empty = "❌ Чорний список порожній."

act_proxy = "Введи проксі в форматі <u>login:password@ip:port</u> або <u>ip:port</u>."
proxy_already_exists = "❌ Проксі <code>{}</code> вже додані."
proxy_added = "✅ Проксі <u>{}</u> додано успішно."
proxy_format = "❌ Проксі повинні мати формат <u>login:password@ip:port</u> або <u>ip:port</u>."
proxy_adding_error = "❌ Під час додавання проксі сталася якась помилка."
proxy_undeletable = "❌ Ці проксі неможливо видалити, оскільки вони зараз використовуються."

act_edit_watermark = "Введи новий текст водяного знака. Наприклад:\n{}\n<code>𝑭𝒖𝒏𝑷𝒂𝒚 𝑪𝒂𝒓𝒅𝒊𝒏𝒂𝒍</code>\n" \
                     "<code>FunPay Cardinal</code>\n<code>[FunPay / Cardinal]</code>\n<code>𝑭𝑷𝑪</code>\n" \
                     "<code>FPC</code>\n<code>🤖</code>\n<code>🐦</code>\n\n" \
                     "Приклади можна скопіювати натисканням і відредагувати на свій розсуд.\nВрахуй, що на FunPay емодзі " \
                     "🐦 виглядає не так, як в Telegram." \
                     "\n\nЯкщо потрібно видалити водяний знак, відправ <code>-</code>."
watermark_changed = "✅ Водяний знак повідомлень змінено."
watermark_deleted = "✅ Водяний знак повідомлень видалено."
watermark_error = "❌ Невалідний водяний знак."

logfile_not_found = "❌ Лог-файл не знайдено."
logfile_sending = "Відправляю лог-файл (це може зайняти деякий час)..."
logfile_error = "❌ Не вдалося відправити лог-файл."
logfile_deleted = "🗑️ Видалено {} лог-файл(-и, -ів)."

update_no_tags = "❌ Не вдалося отримати список версій. Спробуй пізніше."
update_lasted = "✅ У тебе стоїть остання версія FunPayCardinal {}"
update_get_error = "❌ Не вдалося отримати інформацію про нову версію. Спробуй пізніше."
update_available = "<b><u>Доступна нова версія!</u></b>\n\n\n{}\n\n{}"
update_update = "Щоб оновитися, введи команду /update"
update_backup = "✅ Резервна копія конфігів, сховища і плагінів <code>backup.zip</code>.\n\n" \
                "⚠️ НЕ ВІДПРАВЛЯЙ цей архів НІКОМУ. Він містить абсолютно ВЕСЬ вміст і налаштування бота (в тому числі golden_key і товарні файли)."
update_backup_error = "❌ Не вдалося створити бекап конфігів, сховища і плагінів."
update_backup_not_found = "❌ Резервна копія не знайдена."
update_downloaded = "✅ Завантажив оновлення {} (пропущено {} шт.). Встановлюю..."
update_download_error = "❌ Сталася помилка при завантаженні оновлення."
update_done = "✅ Встановив оновлення! Перезапусти <i>FPC</i> за допомогою команди /restart"
update_done_exe = "✅ Встановив оновлення! Новий <code>FPC.exe</code> знаходиться у папці <code>update</code>. " \
                  "Вимкни <i>FPC</i>, перенеси новий <code>FPC.exe</code> на місце старого " \
                  "і запусти <code>Start.bat</code>."
update_install_error = "❌ Сталася помилка при встановленні оновлення."

restarting = "Перезавантажуюсь..."
power_off_0 = """<b><u>Ти впевнений, що хочеш вимкнути мене?</u></b>\n
Увімкнути мене через <i>Telegram</i> ПУ <b><u>не вийде!</u></b>"""
power_off_1 = "На всякий випадок запитаю ще раз.\n\n<b><u>Ти точно впевнений?</u></b>"
power_off_2 = """Просто для протоколу:
тобі доведеться заходити на сервер або підходити до комп'ютера (ну або де я там у тебе) і запускати мене вручну!"""
power_off_3 = """Не те щоб я нав'язуюсь, але якщо ти хочеш застосувати зміни основного конфіга, ти можеш 
просто перезапустити мене командою /restart."""
power_off_4 = "Ти взагалі читаєш мої повідомлення? Перевіримо тебе на уважність: так = ні, ні = так." \
              "Упевнений, ти навіть не читаєш мої повідомлення, а ведь важливу інфу тут пишу."
power_off_5 = "Ну тобто твердо і чітко, так?"
power_off_6 = "Гаразд, гаразд, вимикаюсь..."
power_off_cancelled = "Вимкнення скасовано."
power_off_error = "❌ Дана кнопка не належить цьому запуску.\nВиклич це меню знову."

enter_msg_text = "Введи текст повідомлення."
msg_sent = "✅ Повідомлення відправлено у чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>."
msg_sending_error = "❌ Не вдалося відправити повідомлення у чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>."
send_img = "Відправ мені зображення."

greeting_changed = "✅ Текст привітання змінено."
greeting_cooldown_changed = "✅ Кулдаун привітального повідомлення змінено: {} дн."
order_confirm_changed = "✅ Текст відповіді на підтвердження замовлення змінено!"
review_reply_changed = "✅ Текст відповіді на відгук з {} змінено!"
review_reply_empty = "❌ Відповідь на відгук з {} не встановлено."
review_reply_text = "Відповідь на відгук з {}:\n<code>{}</code>"

get_chat_error = "❌ Не вдалося отримати дані про чат."
viewing = "Переглядає"
you = "Ти"
support = "тех. підтримка"
photo = "Фотографія"

refund_attempt = "❌ Не вдалося повернути кошти за замовлення <code>#{}</code>.\nЗалишилося спроб: <code>{}</code>."
refund_error = "❌ Не вдалося повернути кошти за замовлення <code>#{}</code>."
refund_complete = "✅ Кошти за замовлення <code>#{}</code> повернуто."

updating_profile = "Оновлюю статистику облікового запису (це може зайняти деякий час)..."
profile_updating_error = "❌ Не вдалося оновити статистику облікового запису."

act_change_golden_key = "Введи golden_key"
cookie_changed = "✅ golden_key успішно змінено{}.\n"
cookie_changed2 = "Перезапустіть бота командою /restart."
cookie_incorrect_format = "❌ Неправильний формат golden_key. Спробуй ще раз."
cookie_error = "❌ Авторизуватися не вдалося. Можливо, введено невірний golden_key?"

ad_lot_not_found_err = "❌ Не вдалося виявити лот з індексом <code>{}</code>."
ad_already_ad_err = "❌ У лота <code>{}</code> вже налаштована авто-видача."
ad_lot_already_exists = "❌ До лоту <code>{}</code> вже прив'язана авто-видача."
ad_lot_linked = "✅ Авто-видача прив'язана до лоту <code>{}</code>."
ad_link_gf = "Введи назву товарного файлу.\nЯкщо ти хочеш відв'язати товарний файл, відправ <code>-</code>\n\n" \
             "Якщо файлу не існує, він буде створений автоматично."
ad_gf_unlinked = "✅ Товарний файл успішно відв'язаний від лоту <code>{}</code>."
ad_gf_linked = "✅ Товарний файл <code>storage/products/{}</code> прив'язаний до лоту <code>{}</code>."
ad_gf_created_and_linked = "✅ Товарний файл <code>storage/products/{}</code> <b><u>створено</u></b> і прив'язано до лоту <code>{}</code>."
ad_creating_gf = "🔄 Створюю товарний файл <code>storage/products/{}</code>..."
ad_product_var_err = "❌ До лоту <code>{}</code> прив'язаний товарний файл, проте в тексті видачі відсутня змінна <code>$product</code>."
ad_product_var_err2 = "❌ Неможливо прив'язати товарний файл, оскільки в тексті видачі відсутня змінна <code>$product</code>."
ad_text_changed = "✅ Текст видачі лоту <code>{}</code> змінено на <code>{}</code>."
ad_updating_lots_list = "Оновлюю дані про лоти і категорії (це може зайняти деякий час)..."
ad_lots_list_updating_err = "❌ Не вдалося оновити дані про лоти і категорії."
gf_not_found_err = "❌ Не вдалося виявити товарний файл з індексом <code>{}</code>."
copy_lot_name = "Відправ назву лоту точно як на FunPay."

act_create_gf = "Введи назву нового товарного файлу."
gf_name_invalid = "❌ Невалідне ім'я файлу.\n\n" \
                  "У назві дозволені тільки <b><u>англійські</u></b> " \
                  "і <b><u>російські</u></b> символи, а також <code>_</code>, <code>-</code> і <code>пробіл</code>."
gf_already_exists_err = "❌ Файл <code>{}</code> уже існує."
gf_creation_err = "❌ Сталася помилка при створенні файлу <code>{}</code>."
gf_created = "✅ Товарний файл <code>storage/products/{}</code> створено."
gf_amount = "Товарів у файлі"
gf_uses = "Використовується у лотах"
gf_send_new_goods = "Відправ товари, які ти хочеш додати у товарний файл.\n\nКожен новий рядок (<code>Shift+Enter</code>) - новий товар."
gf_add_goods_err = "❌ Не вдалося додати товари у файл."
gf_new_goods = "✅ <code>{}</code> товар(-и, -ів) додано(-і) у файл  <code>storage/products/{}</code>."
gf_empty_error = "❌ Файл storage/products/{} порожній."
gf_linked_err = "❌ Файл <code>storage/products/{}</code> прив'язаний до одного або кількох лотів.\n" \
                "Перед видаленням цього товарного файлу відв'яжи його від усіх лотів."
gf_deleting_err = "❌ Не вдалося видалити файл <code>storage/products/{}</code>."

ar_cmd_not_found_err = "❌ Не вдалося виявити команду з індексом <code>{}</code>."
ar_subcmd_duplicate_err = "❌ У наборі команд дублюється команда <code>{}</code>."
ar_cmd_already_exists_err = "❌ Команда <code>{}</code> уже існує."
ar_enter_new_cmd = "Введи нову команду (або кілька команд через знак <code>|</code>)."
ar_cmd_added = "Додано нову команду <code>{}</code>."
ar_response_text = "Текст відповіді"
ar_notification_text = "Текст сповіщення"
ar_response_text_changed = "✅ Текст відповіді команди <code>{}</code> змінено на <code>{}</code>."
ar_notification_text_changed = "✅ Текст сповіщення команди <code>{}</code> змінено на <code>{}</code>."

cfg_main = "Основний конфіг.\n\n⚠️ НЕ ВІДПРАВЛЯЙ цей файл НІКОМУ."
cfg_ar = "Конфіг автовідповіді."
cfg_ad = "Конфіг авто-видачі."
cfg_not_found_err = "❌ Конфіг {} не знайдено."
cfg_empty_err = "❌ Конфіг {} порожній."

tmplt_not_found_err = "❌ Не вдалося знайти шаблон з індексом <code>{}</code>."
tmplt_already_exists_err = "❌ Такий шаблон уже існує."
tmplt_added = "✅ Шаблон додано."
tmplt_msg_sent = "✅ Повідомлення відправлено у чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>.\n\n<code>{}</code>"

pl_not_found_err = "❌ Не вдалося знайти плагін з UUID <code>{}</code>."
pl_file_not_found_err = "❌ Не вдалося знайти файл <code>{}</code>.\nПерезавантажте <i>FPC</i> за допомогою команди /restart."
pl_commands_list = "Команди плагіна <b><i>{}</i></b>."
pl_author = "Автор"
pl_new = "Надішли мені плагін.\n\n<b>⚠️ УВАГА! Завантаження плагінів з сумнівних джерел може призвести до сумних наслідків.\n" \
         "@fpc_plugins вирішує більшість можливих проблем.</b>"

au_user_settings = "Налаштування для користувача {}"
adv_fpc = "😎 FunPay Cardinal - найкращий бот для FunPay"
adv_description = """🐦 𝑭𝒖𝒏𝑷𝒂𝒚 𝑪𝒂𝒓𝒅𝒊𝒏𝒂𝒍 v{}🐦

🤖 Автовидача товарів
🚀 Автопідняття лотів
💬 Автовідповідь на заготовлені команди
🔄 Автовідновлення лотів після продажу
📦 Автодеактивація лотів, якщо товари закінчилися
🔝 Вічний онлайн
📲 Сповіщення в Telegram
🕹️ Повноцінна панель управління в Telegram
🧩 Плагіни
🌟 І багато іншого...

🛠️ Створено за допомогою: github.com/sidor0912/FunPayCardinal
👨‍💻 Автор: @woopertail, @sidor0912
💰 Донат: @sidor_donate
🔄 Оновлення: @fpc_updates
🧩 Плагіни: @fpc_plugins
💬 Чат: @funpay_cardinal"""

# - Описи меню
desc_main = "Вибери категорію налаштувань."
desc_lang = desc_main
desc_gs = "Тут ти можеш включати та вимикати основні функції <i>FPC</i>."
desc_ns = """Тут ти можеш налаштувати сповіщення.\n
<b><u>Налаштування роздільні для кожного <i>Telegram</i> чату!</u></b>\n
ID поточного чату: <code>{}</code>"""
desc_bl = "Тут ти можеш встановити обмеження для користувачів з ЧС."
desc_ar = "Тут ти можеш додати команди або редагувати існуючі."
desc_ar_list = "Вибери команду / набір команд, який тебе цікавить."

desc_ad = "Тут ти можеш змінити налаштування авто-видачі, завантажити / вивантажити товарні файли і т.д."
desc_ad_list = "Це список лотів, до яких прив'язана авто-видача. Вибери лот, який тебе цікавить."
desc_ad_fp_lot_list = "Це список лотів з твого профілю FunPay. Вибери лот, до якого хочеш прив'язати авто-видачу.\n" \
                      "Якщо у списку відсутній якийсь лот, натисни кнопку <code>🔄 Оновити</code>.\n\n" \
                      "Останнє сканування: {}"
desc_gf = "Вибери товарний файл, який тебе цікавить."

desc_mv = "Тут ти можеш налаштувати вид сповіщень про нові повідомлення."
desc_gr = "Тут ти можеш налаштувати привітання нових користувачів.\n\n<b>Текст привітання:</b>\n<code>{}</code>"
desc_oc = "Тут ти можеш налаштувати повідомлення на підтвердження замовлення.\n\n<b>Текст повідомлення:</b>\n<code>{}</code>"
desc_or = "Тут ти можеш налаштувати відповідь на відгуки."
desc_an = "Тут ти можеш налаштувати сповіщення про оголошення."
desc_cfg = "Тут ти можеш завантажити і вивантажити конфіги."
desc_tmplt = "Тут ти можеш додавати та видаляти шаблони відповідей."
desc_pl = "Тут ти можеш отримати інформацію про плагіни, а також налаштувати їх.\n\n" \
          "⚠️ <b><u>Після активації / деактивації / додавання / видалення плагіна, необхідно " \
          "перезапустити бота!</u></b> (/restart)"
desc_au = "Тут ти можеш налаштувати авторизацію у ПУ Telegram."
desc_proxy = "Тут ти можеш налаштувати проксі."

# - Опис команд
cmd_menu = "відкрити налаштування"
cmd_language = "змінити мову"
cmd_profile = "статистика облікового запису"
cmd_golden_key = "змінити golden_key"
cmd_test_lot = "створити ключ видачі"
cmd_upload_chat_img = "(чат) вивантажити зображення на FunPay"
cmd_upload_offer_img = "(лот) вивантажити зображення на FunPay"
cmd_upload_plugin = "вивантажити плагін"
cmd_ban = "додати користувача до ЧС"
cmd_unban = "видалити користувача з ЧС"
cmd_black_list = "чорний список"
cmd_watermark = "змінити водяний знак повідомлень"
cmd_logs = "завантажити поточний лог-файл"
cmd_del_logs = "видалити старі лог-файли"
cmd_about = "про поточну версію"
cmd_check_updates = "перевірити на наявність оновлень"
cmd_update = "оновитися до наст. версії"
cmd_sys = "інформація про навантаження на систему"
cmd_create_backup = "створити бекап"
cmd_get_backup = "отримати бекап"
cmd_restart = "перезапустити FPC"
cmd_power_off = "вимкнути FPC"

# - Опис змінних
v_edit_greeting_text = "Введи текст привітального повідомлення."
v_edit_greeting_cooldown = "Введи кулдаун привітального повідомлення (у днях)."
v_edit_order_confirm_text = "Введи текст відповіді на підтвердження замовлення."
v_edit_review_reply_text = "Введи текст відповіді на відгук з {}."
v_edit_delivery_text = "Введи новий текст видачі."
v_edit_response_text = "Введи новий текст відповіді."
v_edit_notification_text = "Введи новий текст Telegram сповіщення."
V_new_template = "Введи текст нового шаблону відповіді."
v_list = "Список змінних"
v_date = "<code>$date</code> - поточна дата у форматі <i>ДД.ММ.РРРР</i>."
v_date_text = "<code>$date_text</code> - поточна дата у форматі <i>1 січня</i>."
v_full_date_text = "<code>$full_date_text</code> - поточна дата у форматі <i>1 січня 2001 року</i>."
v_time = "<code>$time</code> - поточний час у форматі <i>ГГ:ХХ</i>."
v_full_time = "<code>$full_time</code> - поточний час у форматі <i>ГГ:ХХ:СС</i>."
v_photo = "<code>$photo=[PHOTO ID]</code> - фотографія. Замість <code>[PHOTO ID]</code> " \
          "впиши ID фотографії, отриманий за допомогою команди /upload_chat_img"
v_sleep = "<code>$sleep=[TIME]</code> - затримка. Замініть <code>[TIME]</code> " \
          "на час затримки в секундах."
v_order_id = "<code>$order_id</code> - ID замовлення (без #)"
v_order_link = "<code>$order_link</code> - посилання на замовлення"
v_order_title = "<code>$order_title</code> - назва замовлення."
v_order_params = "<code>$order_params</code> - параметри замовлення."
v_order_desc_and_params = "<code>$order_desc_and_params</code> - назва замовлення та/або параметри."
v_order_desc_or_params = "<code>$order_desc_or_params</code> - назва замовлення або параметри."
v_game = "<code>$game</code> - назва гри."
v_category = "<code>$category</code> - назва підкатегорії."
v_category_fullname = "<code>$category_fullname</code> - повна назва підкатегорії (назва підкатегорії + назва гри)."
v_product = "<code>$product</code> - товар(-и), отриманий(-і) з товарного файлу. " \
            "Якщо товарний файл не прив'язаний - не буде замінено."
v_chat_id = "<code>$chat_id</code> - ID чату."
v_chat_name = "<code>$chat_name</code> - назва чату."
v_message_text = "<code>$message_text</code> - текст повідомлення співрозмовника."
v_username = "<code>$username</code> - нікнейм співрозмовника."

# Тексти винятків
exc_param_not_found = "Параметр \"{}\" не знайдено."
exc_param_cant_be_empty = "Значення параметра \"{}\" не може бути порожнім."
exc_param_value_invalid = "Недопустиме значення параметра \"{}\". Допустимі значення: {}. Поточне значення: \"{}\"."
exc_goods_file_not_found = "Вказаний товарний файл \"{}\" не знайдено."
exc_goods_file_is_empty = "У файлі \"{}\" відсутні товари."
exc_not_enough_items = "У файлі \"{}\" недостатньо товарів. Запит на: {}, в наявності: {}."
exc_no_product_var = "Вказано \"productsFileName\", але у параметрі \"response\" відсутня змінна $product."
exc_no_section = "Секція відсутня."
exc_section_duplicate = "Виявлено дублікат секції."
exc_cmd_duplicate = "Команда або суб-команда \"{}\" вже існує."
exc_cfg_parse_err = "Помилка в конфігу {}, у секції [{}]: {}"
exc_plugin_field_not_found = "Не вдалося завантажити плагін \"{}\": відсутнє обов'язкове поле \"{}\"."

# Логи
log_tg_initialized = "$MAGENTATelegram бот ініціалізовано."
log_tg_started = "$CYANTelegram бот $YELLOW@{}$CYAN запущено."
log_tg_handler_error = "Сталася помилка під час виконання обробника Telegram бота."
log_tg_update_error = "Сталася помилка ({}) під час отримання оновлень Telegram (введено некоректний токен?)."
log_tg_notification_error = "Сталася помилка під час відправлення сповіщення в чат $YELLOW{}$RESET."
log_access_attempt = "$MAGENTA@{} (ID: {})$RESET спробував отримати доступ до ПУ. Тримаю його як можу!"
log_click_attempt = "$MAGENTA@{} (ID: {})$RESET натискає кнопки ПУ в чаті $MAGENTA@{} (ID: {})$RESET. У нього нічого не вийде!"
log_access_granted = "$MAGENTA@{} (ID: {})$RESET отримав доступ до ПУ."
log_new_ad_key = "$MAGENTA@{} (ID: {})$RESET створив ключ для видачі $YELLOW{}$RESET: $CYAN{}$RESET."
log_user_blacklisted = "$MAGENTA@{} (ID: {})$RESET додав $YELLOW{}$RESET до ЧС."
log_user_unbanned = "$MAGENTA@{} (ID: {})$RESET видалив $YELLOW{}$RESET з ЧС."
log_watermark_changed = "$MAGENTA@{} (ID: {})$RESET змінив водяний знак повідомлень на $YELLOW{}$RESET."
log_watermark_deleted = "$MAGENTA@{} (ID: {})$RESET видалив водяний знак повідомлень."
log_greeting_changed = "$MAGENTA@{} (ID: {})$RESET змінив текст привітання на $YELLOW{}$RESET."
log_greeting_cooldown_changed = "$MAGENTA@{} (ID: {})$RESET змінив кулдаун привітального повідомлення на $YELLOW{}$RESET дн."
log_order_confirm_changed = "$MAGENTA@{} (ID: {})$RESET змінив текст відповіді на підтвердження замовлення на $YELLOW{}$RESET."
log_review_reply_changed = "$MAGENTA@{} (ID: {})$RESET змінив текст відповіді на відгук з {} зір. на $YELLOW{}$RESET."
log_param_changed = "$MAGENTA@{} (ID: {})$RESET змінив параметр $CYAN{}$RESET секції $YELLOW[{}]$RESET на $YELLOW{}$RESET."
log_notification_switched = "$MAGENTA@{} (ID: {})$RESET перемкнув сповіщення $YELLOW{}$RESET для чату $YELLOW{}$RESET на $CYAN{}$RESET."
log_ad_linked = "$MAGENTA@{} (ID: {})$RESET прив'язав авто-видачу до лоту $YELLOW{}$RESET."
log_ad_text_changed = "$MAGENTA@{} (ID: {})$RESET змінив текст видачі лоту $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ad_deleted = "$MAGENTA@{} (ID: {})$RESET видалив авто-видачу лоту $YELLOW{}$RESET."
log_gf_created = "$MAGENTA@{} (ID: {})$RESET створив товарний файл $YELLOWstorage/products/{}$RESET."
log_gf_unlinked = "$MAGENTA@{} (ID: {})$RESET відв'язав товарний файл від лоту $YELLOW{}$RESET."
log_gf_linked = "$MAGENTA@{} (ID: {})$RESET прив'язав товарний файл $YELLOWstorage/products/{}$RESET до лоту $YELLOW{}$RESET."
log_gf_created_and_linked = "$MAGENTA@{} (ID: {})$RESET створив і прив'язав товарний файл $YELLOWstorage/products/{}$RESET до лоту $YELLOW{}$RESET."
log_gf_new_goods = "$MAGENTA@{} (ID: {})$RESET додав $CYAN{}$RESET товар(-ів) у файл $YELLOWstorage/products/{}$RESET."
log_gf_downloaded = "$MAGENTA@{} (ID: {})$RESET запитав товарний файл $YELLOWstorage/products/{}$RESET."
log_gf_deleted = "$MAGENTA@{} (ID: {})$RESET видалив товарний файл $YELLOWstorage/products/{}$RESET."
log_ar_added = "$MAGENTA@{} (ID: {})$RESET додав нову команду $YELLOW{}$RESET."
log_ar_response_text_changed = "$MAGENTA@{} (ID: {})$RESET змінив текст відповіді команди $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ar_notification_text_changed = "$MAGENTA@{} (ID: {})$RESET змінив текст сповіщення команди $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ar_cmd_deleted = "$MAGENTA@{} (ID: {})$RESET видалив команду $YELLOW{}$RESET."
log_cfg_downloaded = "$MAGENTA@{} (ID: {})$RESET запитав конфіг $YELLOW{}$RESET."
log_tmplt_added = "$MAGENTA@{} (ID: {})$RESET додав шаблон відповіді $YELLOW\"{}\"$RESET."
log_tmplt_deleted = "$MAGENTA@{} (ID: {})$RESET видалив шаблон відповіді $YELLOW\"{}\"$RESET."
log_pl_activated = "$MAGENTA@{} (ID: {})$RESET активував плагін $YELLOW\"{}\"$RESET."
log_pl_deactivated = "$MAGENTA@{} (ID: {})$RESET деактивував плагін $YELLOW\"{}\"$RESET."
log_pl_deleted = "$MAGENTA@{} (ID: {})$RESET видалив плагін $YELLOW\"{}\"$RESET."
log_pl_delete_handler_err = "Сталася помилка під час виконання обробника видалення плагіна $YELLOW\"{}\"$RESET."
# Логи обробників
log_new_msg = "$MAGENTA┌──$RESET Нове повідомлення в переписці з користувачем $YELLOW{} (CID: {}):"
log_sending_greetings = "Користувач $YELLOW{} (CID: {})$RESET написав вперше! Відправляю привітальне повідомлення..."
log_new_cmd = "Отримано команду $YELLOW{}$RESET у чаті з користувачем $YELLOW{} (CID: {})$RESET."
ntfc_new_order = "💰 <b>Нове замовлення:</b> <code>{}</code>\n\n<b><i>🙍‍♂️ Покупець:</i></b>  <code>{}</code>\n" \
                 "<b><i>💵 Сума:</i></b>  <code>{}</code>\n<b><i>📇 ID:</i></b> <code>#{}</code>\n\n<i>{}</i>"
ntfc_new_order_not_in_cfg = "ℹ️ Товар не буде виданий, оскільки до лоту не прив'язана авто-видача."
ntfc_new_order_ad_disabled = "ℹ️ Товар не буде виданий, оскільки авто-видача вимкнена у глобальних перемикачах."
ntfc_new_order_ad_disabled_for_lot = "ℹ️ Товар не буде виданий, оскільки авто-видача вимкнена для даного лота."
ntfc_new_order_user_blocked = "ℹ️ Товар не буде виданий, оскільки користувач знаходиться в ЧС і включено блокування авто-видачі."
ntfc_new_order_will_be_delivered = "ℹ️ Товар буде виданий найближчим часом."
ntfc_new_review = "🔮 Ви отримали {} за замовлення <code>{}</code>!\n\n💬<b>Відгук:</b>\n<code>{}</code>{}"
ntfc_review_reply_text = "\n\n🗨️<b>Відповідь:</b> \n<code>{}</code>"

# Логи кардинала
crd_proxy_detected = "Виявлено проксі."
crd_checking_proxy = "Виконую перевірку проксі..."
crd_proxy_err = "Не вдалося підключитися до проксі. Переконайтеся, що дані введено вірно."
crd_proxy_success = "Проксі успішно перевірено! IP-адреса: $YELLOW{}$RESET."
crd_acc_get_timeout_err = "Не вдалося завантажити дані облікового запису: перевищено тайм-аут очікування."
crd_acc_get_unexpected_err = "Сталася непередбачена помилка при отриманні даних облікового запису."
crd_try_again_in_n_secs = "Спробую знову через {} секунд(-у/-и)..."
crd_getting_profile_data = "Отримую дані про лоти та категорії..."
crd_profile_get_timeout_err = "Не вдалося завантажити дані про лоти облікового запису: перевищено тайм-аут очікування."
crd_profile_get_unexpected_err = "Сталася непередбачена помилка при отриманні даних про лоти та категорії."
crd_profile_get_too_many_attempts_err = "Сталася помилка при отриманні даних про лоти та категорії: перевищено кількість спроб ({})."
crd_profile_updated = "Оновлено інформацію про лоти $YELLOW({})$RESET та категорії $YELLOW({})$RESET профілю."
crd_tg_profile_updated = "Оновлено інформацію про лоти $YELLOW({})$RESET та категорії $YELLOW({})$RESET профілю (TG ПУ)."
crd_raise_time_err = 'Не вдалося підняти лоти категорії $CYAN\"{}\"$RESET. FunPay каже: "{}". Наступна спроба через {}.'
crd_raise_unexpected_err = "Сталася непередбачена помилка при спробі підняти лоти категорії $CYAN\"{}\"$RESET. Пауза на 10 секунд..."
crd_raise_status_code_err = "Помилка {} при піднятті лотів категорії $CYAN\"{}\"$RESET. Пауза на 1 хв..."
crd_lots_raised = "Всі лоти категорії $CYAN\"{}\"$RESET піднято!"
crd_raise_wait_3600 = "Наступна спроба через {}."
crd_msg_send_err = "Сталася помилка при відправленні повідомлення в чат $YELLOW{}$RESET."
crd_msg_attempts_left = "Залишилося спроб: $YELLOW{}$RESET."
crd_msg_no_more_attempts_err = "Не вдалося відправити повідомлення в чат $YELLOW{}$RESET: перевищено кількість спроб."
crd_msg_sent = "Відправлено повідомлення в чат $YELLOW{}$RESET."
crd_session_timeout_err = "Не вдалося оновити сесію: перевищено тайм-аут очікування."
crd_session_unexpected_err = "Сталася непередбачена помилка при оновленні сесії."
crd_session_no_more_attempts_err = "Не вдалося оновити сесію: перевищено кількість спроб."
crd_session_updated = "Сесія оновлена."
crd_raise_loop_started = "$CYANЦикл автопідняття лотів запущено (це не означає, що автопідняття лотів увімкнено)."
crd_raise_loop_not_started = "$CYANЦикл автопідняття не був запущений, оскільки на обліковому записі не виявлено лотів."
crd_session_loop_started = "$CYANЦикл оновлення сесії запущено."
crd_no_plugins_folder = "Папка з плагінами не виявлена."
crd_no_plugins = "Плагіни не виявлені."
crd_plugin_load_err = "Не вдалося завантажити плагін {}."
crd_invalid_uuid = "Не вдалося завантажити плагін {}: невалідний UUID."
crd_uuid_already_registered = "UUID {} ({}) вже зареєстрований."
crd_handlers_registered = "Обробники з $YELLOW{}.py$RESET зареєстровані."
crd_handler_err = "Сталася помилка при виконанні обробника."
crd_tg_au_err = "Не вдалося змінити повідомлення з інформацією про користувача: {}. Спробую без посилання."
